> (pascal-internal 1 1)
1
> (pascal-internal 1 2)
"error"
> (pascal-internal 2 0)
"error"
> (pascal-internal 2 -3)
"error"
> (pascal-internal 2 1)
1
> (pascal-internal 2 2)
1
> (pascal-internal 5 1)
1
> (pascal-internal 5 2)
4
> (pascal-internal 5 3)
6
> (pascal-internal 5 4)
4
> (pascal-internal 5 5)
1